# Accessing Data from Files

## Python Working Directory and File Paths

In [16]:
import pandas as pd
import os          

os.getcwd()

'/Users/satya2/Desktop/Algo Projects/jupyter/training/Python for Data/Data'

In [22]:
os.chdir('Data/')
        
os.getcwd()

'/Users/satya2/Desktop/Algo Projects/jupyter/training/Python for Data/Data'

In [24]:
#os.chdir('/Users/satya2/Desktop/Algo Projects/jupyter/training')
os.chdir('/Users/satya2/Desktop/Algo Projects/jupyter/training/Python for Data')
os.getcwd()

'/Users/satya2/Desktop/Algo Projects/jupyter/training/Python for Data'

In [20]:
os.getcwd()

'/Users/satya2/Desktop/Algo Projects/jupyter/training/Python for Data'

You can list all of the objects in a directory by passing the file path to the os.listdir( ) function:

In [21]:
os.listdir('Data')

['OHLC.csv',
 'Marks.csv',
 'diamonds.csv',
 'pulse.csv',
 'test.csv',
 'OHLC.xlsx',
 'master_tick.csv',
 'NIFTY_OHLC_2021.csv',
 'titanic.csv',
 'final.sqlite',
 'mtcars.csv',
 '.ipynb_checkpoints',
 'draft_saved.csv',
 'tick.csv',
 'dates.csv',
 'OHLC.tsv']

## Reading CSV Files

In [25]:
df1 = pd.read_csv('Data/OHLC.csv')    

df1.head(5)

         Date   Open   High    Low  Close
0  2022-01-03  17387  17647  17383  17626
1  2022-01-04  17681  17828  17594  17805
2  2022-01-05  17820  17945  17749  17925
3  2022-01-06  17769  17798  17656  17746
4  2022-01-07  17798  17905  17705  17813

In [26]:
df1 = pd.read_table('Data/OHLC.csv', sep=',')    

df1.head(5)

         Date   Open   High    Low  Close
0  2022-01-03  17387  17647  17383  17626
1  2022-01-04  17681  17828  17594  17805
2  2022-01-05  17820  17945  17749  17925
3  2022-01-06  17769  17798  17656  17746
4  2022-01-07  17798  17905  17705  17813

In [28]:
df3 = pd.read_csv('Data/OHLC.tsv', sep='\t')  
df3

           Date   Open   High    Low  Close
0    2022-01-03  17387  17647  17383  17626
1    2022-01-04  17681  17828  17594  17805
2    2022-01-05  17820  17945  17749  17925
3    2022-01-06  17769  17798  17656  17746
4    2022-01-07  17798  17905  17705  17813
..          ...    ...    ...    ...    ...
118  2022-06-24  15657  15749  15619  15699
119  2022-06-27  15926  15927  15816  15832
120  2022-06-28  15757  15892  15710  15850
121  2022-06-29  15702  15862  15688  15799
122  2022-06-30  15775  15890  15729  15780

[123 rows x 5 columns]

In [27]:
#df2 = pd.read_table('Data/OHLC.tsv', sep='\t')    
df2 = pd.read_table('Data/OHLC.tsv')    
df2.head(5)

         Date   Open   High    Low  Close
0  2022-01-03  17387  17647  17383  17626
1  2022-01-04  17681  17828  17594  17805
2  2022-01-05  17820  17945  17749  17925
3  2022-01-06  17769  17798  17656  17746
4  2022-01-07  17798  17905  17705  17813

## Reading Excel Files

In [29]:
draft = pd.read_excel('Data/OHLC.xlsx', 
                     sheet_name = 'Sheet2') 

draft.head(5)

        Date     Open     High      Low    Close
0 2022-01-03  17387.0  17647.0  17383.0  17626.0
1 2022-01-04  17681.0  17828.0  17594.0  17805.0
2 2022-01-05  17820.0  17945.0  17749.0  17925.0
3 2022-01-06  17769.0  17798.0  17656.0  17746.0
4 2022-01-07  17798.0  17905.0  17705.0  17813.0

## Reading Web Data

In [30]:
df3 = pd.read_csv('http://api.kimbly.in/DataSets/heights.csv')    

df3.head(5)

    Name  Height (ft)
0   Alex          5.2
1  Satya          5.3
2  Reena          5.1
3  Mohan          4.9
4  Nisha          5.4

## Reading Clipboard Data

In [31]:
clipdata = pd.read_clipboard()
clipdata

   Name Height  (ft)
0     0   Alex   5.2
1     1  Satya   5.3
2     2  Reena   5.1
3     3  Mohan   4.9
4     4  Nisha   5.4

## Reading Web content

In [32]:
df4 = pd.read_html('http://api.kimbly.in/DataSets/OHLC.html')
df4

[     Unnamed: 0           A      B      C      D      E
 0             1        Date   Open   High    Low  Close
 1             2  2022-01-03  17387  17647  17383  17626
 2             3  2022-01-04  17681  17828  17594  17805
 3             4  2022-01-05  17820  17945  17749  17925
 4             5  2022-01-06  17769  17798  17656  17746
 ..          ...         ...    ...    ...    ...    ...
 119         120  2022-06-24  15657  15749  15619  15699
 120         121  2022-06-27  15926  15927  15816  15832
 121         122  2022-06-28  15757  15892  15710  15850
 122         123  2022-06-29  15702  15862  15688  15799
 123         124  2022-06-30  15775  15890  15729  15780

 [124 rows x 6 columns]]

## Writing Data

In [33]:
os.chdir('/Users/satya2/Desktop/Algo Projects/jupyter/training/Python for Data/Data')
df1.to_csv("draft_saved.csv") 
os.listdir()

['OHLC.csv',
 'Marks.csv',
 'diamonds.csv',
 'pulse.csv',
 'test.csv',
 'OHLC.xlsx',
 'master_tick.csv',
 'NIFTY_OHLC_2021.csv',
 'titanic.csv',
 'final.sqlite',
 'mtcars.csv',
 '.ipynb_checkpoints',
 'draft_saved.csv',
 'tick.csv',
 'dates.csv',
 'OHLC.tsv']